In [31]:
import pandas as pd
import matplotlib.pyplot as plt
from numpy import nan, NaN, NAN
import numpy as np

In [4]:
s = pd.Series(["홍길동", 28], index=["Name", "Age"])  # 28 역시 문자열임에 유의
s["Name"], s["Age"]

('홍길동', 28)

In [5]:
kor_s = pd.Series([80, 75, 90, 100, 65])
kor_s.describe()

count      5.000000
mean      82.000000
std       13.509256
min       65.000000
25%       75.000000
50%       80.000000
75%       90.000000
max      100.000000
dtype: float64

In [6]:
kor_s.std()

13.509256086106296

In [7]:
kor_s.isin([100])

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [8]:
s2 = pd.Series([1, 5, 6, 8, 4, 1, 4, 10])
kor_s + s2

0     81.0
1     80.0
2     96.0
3    108.0
4     69.0
5      NaN
6      NaN
7      NaN
dtype: float64

In [9]:
scores_df = pd.DataFrame({
    "KOR": [80, 90, 75],
    "ENG": [90, 80, 70],
    "MATH": [80, 90, 85]
}, index=["홍길동", "김철수", "이영희"])
scores_df

     KOR  ENG  MATH
홍길동   80   90    80
김철수   90   80    90
이영희   75   70    85

In [10]:
scores_df.loc["김철수"], type(scores_df.loc["김철수"])

(KOR     90
 ENG     80
 MATH    90
 Name: 김철수, dtype: int64,
 pandas.core.series.Series)

In [11]:
scores_df["TOTAL"] = scores_df["KOR"] + scores_df["ENG"] + scores_df["MATH"]
scores_df["AVERAGE"] = scores_df["TOTAL"] / 3
scores_df

     KOR  ENG  MATH  TOTAL    AVERAGE
홍길동   80   90    80    250  83.333333
김철수   90   80    90    260  86.666667
이영희   75   70    85    230  76.666667

In [12]:
filtered_df = scores_df[scores_df["AVERAGE"] > 80]
filtered_df

     KOR  ENG  MATH  TOTAL    AVERAGE
홍길동   80   90    80    250  83.333333
김철수   90   80    90    260  86.666667

In [14]:
my_thieves = pd.read_csv("./data/thieves.txt", sep="\t", header=None)
my_thieves

     0      1     2
0  홍길동  175.8  73.2
1  전우치  170.2  66.3
2  임꺽정  186.7  88.2
3  장길산  188.3  90.0

In [16]:
thieves_df2 = pd.read_csv("./data/thieves.txt", header=None, sep="\t", index_col = 0)
thieves_df2

         1     2
0
홍길동  175.8  73.2
전우치  170.2  66.3
임꺽정  186.7  88.2
장길산  188.3  90.0

In [18]:
thieves_df2.loc["홍길동"]

1    175.8
2     73.2
Name: 홍길동, dtype: float64

In [25]:
thieves_df2.columns = ["height", "weights"]
thieves_df2.index.name = "name"
thieves_df2

      height  weights
name
홍길동    175.8     73.2
전우치    170.2     66.3
임꺽정    186.7     88.2
장길산    188.3     90.0

In [26]:
thieves_df2.to_csv("./data/mythieves.csv")

In [28]:
exam_scores = pd.Series([90, 80, 120, nan, 95, 80, -10])
exam_scores

0     90.0
1     80.0
2    120.0
3      NaN
4     95.0
5     80.0
6    -10.0
dtype: float64

In [29]:
pd.isnull(exam_scores)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [32]:
np.count_nonzero(pd.isnull(exam_scores))

1

In [33]:
~exam_scores.isin(range(0, 101))
exam_scores[~exam_scores.isin(range(0, 101))] = nan
print(exam_scores)

0    90.0
1    80.0
2     NaN
3     NaN
4    95.0
5    80.0
6     NaN
dtype: float64

In [34]:
# 결측치를 중앙값으로 대체
med_score = exam_scores[exam_scores.notnull()].median()
print(med_score)
exam_scores[exam_scores.isnull()] = med_score
print("평균:", exam_scores.mean())

85.0
평균: 85.71428571428571